# В одной базе данных хранится информация о членах нескольких разных семей. Хранение реализовано
# с помощью словаря с парами «Ф. И. — возраст».
# Напишите программу, которая запрашивает у пользователя фамилию и выводит на экран возраст
# всех членов одной семьи. Учтите, что, например, у двух людей разного пола фамилии различаются окончаниями.
# Поиск не должен быть регистрозависимым.
# Пример:
# Введите фамилию: Сидоров
#
# Сидоров Никита 35
# Сидорова Алина 34
# Сидоров Павел 10
# Действие «Поиск человека по фамилии»: программа запрашивает фамилию и выводит все контакты с
# такой фамилией и их номера телефонов. Поиск не должен зависеть от регистра символов.
#
